a = input()
a = tuple(a)
print(a)


#a = input(): Эта строка предлагает пользователю ввести строку символов с помощью функции input() и присваивает введенную строку переменной a.
#a = кортеж(a): После получения входной строки эта строка преобразует строку a в кортеж. В этом случае строка преобразуется в кортеж из отдельных символов.
#print(a): Наконец, в этой строке выводится результирующий кортеж, который содержит отдельные символы из входной строки.
#Итак, код принимает строку, введенную пользователем, и, применяя функцию tuple() к этой строке, преобразует ее в кортеж, где каждый символ исходной строки становится элементом кортежа.