set_A = {1, 2, 3, 4, 5}
set_B = {5, 7, 8, 9, 2, 10}

symmetric_difference_set = set_A ^ set_B
print(symmetric_difference_set)


#set_A Установить = {1, 2, 3, 4, 5}: Эта строка определяет набор с именем set_A с элементами 1, 2, 3, 4 и 5.
#set_B Установить = {5, 7, 8, 9, 2, 10}: Эта строка определяет другой набор, называемый set_B, с элементами 5, 7, 8, 9, 2, и 10.
#symmetric_difference_set = set_A ^ set_B: В этой строке вычисляется симметричная разница между set_A и set_B с использованием оператора симметричной разницы (^). Симметричная разность двух наборов содержит элементы, которые находятся в любом из наборов, но не в обоих. В этом случае он будет содержать элементы, которые являются inset_A или set_B, но не в обоих.
#print(symmetric_difference_set): Наконец, в этой строке выводится symmetric_difference_set, который содержит элементы, уникальные либо для set_A, либо для set_B.
#Итак, код вычисляет и печатает симметричную разницу между set_A и set_B, которые являются элементами, уникальными для любого из двух наборов.